aaron-bond.better-comments
akamud.vscode-theme-onedark
alefragnani.project-manager
anthropic.claude-code
bierner.markdown-preview-github-styles
bradlc.vscode-tailwindcss
christian-kohler.npm-intellisense
cirlorm.mobileview
codezombiech.gitignore
csstools.postcss
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
docker.docker
donjayamanne.git-extension-pack
donjayamanne.githistory
dotjoshjohnson.xml
dzgmelody.vscode-changelog-snippets
eamodio.gitlens
ecmel.vscode-html-css
ericsia.pythonsnippets3
felipecaputo.git-project-manager
firefox-devtools.vscode-firefox-debug
formulahendry.auto-rename-tag
github.copilot-chat
github.remotehub
github.vscode-github-actions
github.vscode-pull-request-github
gruntfuggly.todo-tree
howardzuo.vscode-git-tags
huizhou.githd
icrawl.discord-vscode
ivangabriele.vscode-git-add-and-commit
kevinrose.vsc-python-indent
kilocode.kilo-code
leonardssh.vscord
mechatroner.rainbow-csv
mhutchie.git-graph
ms-azuretools.vscode-containers
ms-edgedevtools.vscode-edge-devtools
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.live-server
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.remote-server
naumovs.color-highlight
oderwat.indent-rainbow
openai.chatgpt
oracle.oracle-java
pkief.material-icon-theme
pleiades.java-extension-pack-jdk
quicktype.quicktype
rdebugger.r-debugger
redhat.java
redhat.vscode-xml
reditorsupport.r
reditorsupport.r-syntax
redjue.git-commit-plugin
ritwickdey.liveserver
rlnt.keep-a-changelog
seyyedkhandon.firacode
seyyedkhandon.tpack
shardulm94.trailing-spaces
streetsidesoftware.code-spell-checker
tomoki1207.pdf
vmware.vscode-boot-dev-pack
vmware.vscode-spring-boot
vscjava.migrate-java-to-azure
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-java-upgrade
vscjava.vscode-maven
vscjava.vscode-spring-boot-dashboard
vscjava.vscode-spring-initializr
vscodevim.vim
vunguyentuan.vscode-css-variables
vunguyentuan.vscode-postcss
wakatime.vscode-wakatime
yzane.markdown-pdf
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
ziyasal.vscode-open-in-github
